brew "chezmoi"
brew "fd"
brew "fish"
brew "lazygit"
brew "neovim"
brew "node"
brew "starship"
brew "tmux"
brew "uv"
cask "claude-code"
cask "codex"

{{ if eq .chezmoi.os "darwin" }}
brew "mas"
cask "font-maple-mono-nf-cn"
cask "iterm2"
cask "itermai"
cask "itermbrowserplugin"
cask "spotify"
mas "Immersive Translate", id: 6447957425
mas "Infuse", id: 1136220934
mas "Lark", id: 6449830127
mas "Shadowrocket", id: 932747118
mas "The Unarchiver", id: 425424353
mas "uBlock Origin Lite", id: 6745342698
mas "Userscripts", id: 1463298887
mas "Vimlike", id: 1584519802
mas "WeChat", id: 836500024
mas "Windows App", id: 1295203466
mas "WPS Office", id: 1468073139
mas "Xcode", id: 497799835
{{ end }}
